app/controllers/photos_controller.rb

SELECT * FROM "photos"
---
  def index
    @photos = Photo.all