app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
---
  def show
    @post = Post.find(params[:id])