app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all :order => "created_at DESC"

SELECT * FROM "posts"
---
  def manage
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2010-02-01 21:22:47', 'First Noisey Practice', 'Yesterday we finally realized the typical format of a band, by getting ourselves into a practice room for 30 minutes.
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
UPDATE "posts" SET "updated_at" = '2011-03-17 20:45:06.388647', "title" = 'New Title' WHERE ("posts"."id" = 1)
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 1)
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy