app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" ORDER BY order_int DESC
---
  def index
    @songs = Song.all :order => "order_int DESC"

SELECT * FROM "songs"
---
  def manage
    @songs = Song.all

SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 1) LIMIT 1
---
  def show
    @song = Song.find(params[:id])

SELECT * FROM "songs" ORDER BY name DESC
---
  def media_player
    @songs = Song.all :order => "name DESC"

INSERT INTO "songs" ("url", "created_at", "updated_at", "order_int", "name") VALUES ('embed url', '2011-03-17 20:50:35.832816', '2011-03-17 20:50:35.832816', NULL, 'Ash used escape rope')
---
  def create
    @song = Song.new(params[:song])
    if @song.save

SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 1) LIMIT 1
---
  def edit
    @song = Song.find(params[:id])

SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 1) LIMIT 1
UPDATE "songs" SET "updated_at" = '2011-03-17 20:45:08.256160', "name" = 'New Name' WHERE ("songs"."id" = 1)
---
  def update
    @song = Song.find(params[:id])
    if @song.update_attributes(params[:song])

SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 1) LIMIT 1
DELETE FROM "songs" WHERE ("songs"."id" = 1)
---
  def destroy
    @song = Song.find(params[:id])
    @song.destroy