app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-05-27 19:57:36', 'ba4c106fd1ffd2649715043b51bf2c61659ef50dff6e405e802bf7957b2ae8b3ae25d1b5e36365204f5171f35950cfe51b0c8e3a0d7efc40d9286c5bb66a58ea', '2010-05-27 19:57:36', 'th3james', 'xc7SyHcXzX549FpfqQco', '29de21d67091bc2bbab8642d93a2ccccaaa7020a302783bb0f5f3aa0238c743bb4d8fa5f7eedfc951814b24c3e01e3f080739b9764266a0c0ec0d7cb3524c12e', 'barcodechannel@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save